#pragma once

#include <iostream>

using namespace std;

// На первом курсе M = 40 студентов. Каждый из студентов в понедельник получает оценку по программированию, во вторник —
// оценку по математике, в среду — по физике в пределах от 2 до 5 каждая. Всего в году N = 35 недель, когда студенты
// учатся. Лучшим считается студент, который наибольшее количество недель продержался без троек (т.е. получал не ниже
// 4). Сформируйте три целочисленных массива нужного размера. Задайте оценки с помощью генерации случайных чисел.
// Найдите лучшего студента.
