#pragma once

#include <iostream>

using namespace std;

// Создайте структуру с именем STUDENT, содержащую следующие поля:
// - Name — фамилия и инициалы;
// - Year — курс;
// - Rating — успеваемость (массив из пяти элементов).

// Напишите программу, выполняющую:
// 1. ввод с клавиатуры данных в массив STUD, состоящий из 10 структур типа
// STUDENT. Записи должны быть упорядочены по алфавиту;
// 2. вывод на экран записей упорядоченного списка студентов, средний бал которых
// превышает общий средний бал;
// 3. если таких студентов нет — выведите соответствующее сообщение.

class StudentRating {
public:
    void run() {}
};